# Student Performace Analysis

#### Life cycle of machine Learning
- Define a Problem statement 
- Data Collection 
- Data Cleaning and Preprocessing
- Exploratory Data Analysis (EDA) 
- Feature Engineering and Selection 
- Model selection 
- Model Training 
- Model Evaluation and Tuning 
- Model Deployment 
- Model Monitoring and Maintenance

#### 1. Problem Statement 
This project analysis performance of students based on their CGPA and internship and Placed and preidcted their salary based their persent features. 
#### 2. Data Collection 
Data Source: https://www.kaggle.com/datasets/rkiattisak/student-performance-in-mathematics.

This data consist of 5 columns and 1000 rows
#### 3. import neccessary Libraray

In [2]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt     
import seaborn as sns 
%matplotlib inline 
import warnings
warnings.filterwarnings('ignore')

Read data from csv file using Pandas libaray

In [3]:
df = pd.read_csv("data\exams.csv")

Read top 5 rows

In [4]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group D,some college,standard,completed,59,70,78
1,male,group D,associate's degree,standard,none,96,93,87
2,female,group D,some college,free/reduced,none,57,76,77
3,male,group B,some college,free/reduced,none,70,70,63
4,female,group D,associate's degree,standard,none,83,85,86

Shape of Dataset

In [5]:
df.shape

(1000, 8)

#### Data information 
- Student_id:- Unique identity of Each Student 
- CGPA :- Marks and Grade of student in Float pointing number 
- internships :- How many internship done by each students?
- Placed :- Is there student is Placed or not. 
- Salary : This is our target variable.

#### Check and Cleaning Data

- Check miossing values. 
- Check Duplicates. 
- check data type.
- Check unnique values in each columns 
- Check statistics of data set.
- Check various categories present in the different categorical column

In [6]:
# Check missing values
df.isna().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [7]:
# Check duplicated
df.duplicated().sum()

np.int64(0)

In [10]:
# check data type and summary of dataset 
print(df.info())
print()
print(df.dtypes)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB
None

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [11]:
# Check unoque values of each columns. 
df.nunique()

gender                          2
race/ethnicity                  5
parental level of education     6
lunch                           2
test preparation course         2
math score                     79
reading score                  71
writing score                  74
dtype: int64

In [12]:
# check the statistics of data 
df.describe()

        math score  reading score  writing score
count  1000.000000    1000.000000    1000.000000
mean     67.810000      70.382000      69.140000
std      15.250196      14.107413      15.025917
min      15.000000      25.000000      15.000000
25%      58.000000      61.000000      59.000000
50%      68.000000      70.500000      70.000000
75%      79.250000      80.000000      80.000000
max     100.000000     100.000000     100.000000

In [15]:
df.describe(include="all")

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
count,1000,1000,1000,1000,1000,1000.000000,1000.000000,1000.000000
unique,2,5,6,2,2,NaN,NaN,NaN
top,male,group C,some college,standard,none,NaN,NaN,NaN
freq,508,323,224,660,656,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,67.810000,70.382000,69.140000
std,NaN,NaN,NaN,NaN,NaN,15.250196,14.107413,15.025917
min,NaN,NaN,NaN,NaN,NaN,15.000000,25.000000,15.000000
25%,NaN,NaN,NaN,NaN,NaN,58.000000,61.000000,59.000000
50%,NaN,NaN,NaN,NaN,NaN,68.000000,70.500000,70.000000
75%,NaN,NaN,NaN,NaN,NaN,79.250000,80.000000,80.000000
max,NaN,NaN,NaN,NaN,NaN,100.000000,100.000000,100.000000